<template>
  <v-container class="d-flex flex-column">
    <h1 class="text-blueGreen my-10">นโยบายข้อมูลส่วนบุคคล</h1>
    <v-row>
      <v-col cols="12" v-for="(policy, index) in policies" :key="index">
        <h3>{{ policy.title }}</h3>
        <p style="white-space: pre-wrap">
          {{ policy.content }}
        </p>
      </v-col>
    </v-row>
    <v-btn
      variant="text"
      class="text-decoration-underline text-blueGreen back-btn mx-auto my-10"
      @click="back"
      >กลับไปหน้าลงทะเบียน</v-btn
    >
  </v-container>
</template>

<script>
export default {
  name: "PolicyTerms",
  data() {
    return {
      policies: [
        {
          title: `1. นิยามข้อมูลส่วนบุคคล`,
          content: `\tอ้างอิงจาก พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ในมาตรา 6 อธิบายนิยามของข้อมูลส่วนบุคคลไว้ สามารถสรุปได้ดังนี้
	“ข้อมูลส่วนบุคคล” หมายความว่า ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม เช่น ชื่อ ,นามสกุล ,ที่อยู่ ,เบอร์โทรศัพท์ ,อีเมล ฯลฯ`,
        },
        {
          title: `2. การเก็บรวบรวมข้อมูลส่วนบุคคล`,
          content: `    2.1 ข้อมูลส่วนบุคคลที่มีการเก็บรวบรวม
     โครงงานนี้ทำการเก็บรวบรวมข้อมูลส่วนบุคคลต่าง ๆ ของท่าน ดังต่อไปนี้
            1. ชื่อ-นามสกุล
            2. อีเมล
            3. ที่อยู่
    2.2 วิธีการเก็บรวบรวมข้อมูลส่วนบุคคล
     โครงงานนี้ จะทำการเก็บรวบรวมข้อมูลส่วนบุคคลจากท่านโดยตรงผ่านการลงทะเบียน
บัญชีผู้ใช้เพื่อใช้งานระบบ
    2.3 ระยะเวลาในการเก็บข้อมูลส่วนบุคคล
     โครงงานนี้ จะทำการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อใช้งานตามวัตถุประสงค์ที่แจ้งไว้เป็นระยะเวลาตามการใช้งานของท่าน เมื่อท่านไม่ต้องการใช้งานแล้วสามารถลบบัญชีออกจากระบบได้ ส่วนของการเก็บรวบรวมข้อมูลกิจกรรมที่ท่านทำในระบบ เช่น การติดต่อประกาศหรือแชทสนทนา จะถูกเก็บไว้เป็นระยะเวลา 30 วัน นับตั้งแต่สถานนะของใบประกาศมีการเปลี่ยนแปลง`,
        },
        {
          title: `3. วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล`,
          content: `    โครงงานนี้ จะเก็บรวบรวม ใช้ หรือเปิดเผย ข้อมูลส่วนบุคคลส่วนบุคคลของท่าน เนื่องด้วยความจำเป็นต่อกระบวนการทำงานของ ระบบของหายได้คืนแบบไร้ศูนย์กายภาพ (Physical Center-less Lost and Found System) เเละเพื่อประโยชน์โดยชอบด้วยกฎหมาย โดยได้รับความยินยอมจากท่านเท่าที่จำเป็นเพื่อวัตถุประสงค์ ดังต่อไปนี้
     3.1 เพื่ออำนวยความสะดวกต่อการเก็บบันทึกกิจกรรมที่ท่านทำในระบบ เช่น การลงประกาศ หรือติดต่อประกาศ โดยเป็นการให้ สร้างบัญชีผู้ใช้งาน ก่อนจะสามารถเข้าใช้งานระบบได้
     3.2 เพื่อสื่อสาร ตอบกลับ และให้ความช่วยเหลือแก่ท่าน หากมีปัญหาขัดข้องในการใช้งาน
     3.3 เพื่อใช้ในการดำเนินกิจกรรมภายในระบบ คือ การระบุสถานที่ ที่อยู่ หรือจุดหมาย ในการรับส่งสิ่งของ ,ยืนยันตัวตนบุคคลเพื่อความสบายใจ ของทั้งท่านเเละผู้ติดต่อว่ามีตัวตนจริง หากมีปัญหาใดสามารถติดต่อตามหาได้ เป็นต้น`,
        },
        {
          title: `4. การคุ้มครองข้อมูลส่วนบุคคล`,
          content: `    ทางผู้จัดทำโครงงาน จะเก็บรักษาข้อมูลส่วนบุคคลของท่านเป็นอย่างดี โดยใช้ฐานข้อมูลส่วนตัว (Firebase) ในการเก็บข้อมูล ทั้งนี้เมื่อมีการดำเนินการกับข้อมูลส่วนบุคคลของท่าน จะแจ้งให้ท่านได้ทราบเเละขอการยินยอมก่อนดำเนินการทุกครั้ง
     ทั้งนี้ ท่านมีความเป็นอิสระในการให้ความยินยอม ให้ระบบเก็บรวบรวม ใช้ หรือเปิดเผย ข้อมูลส่วนบุคคลของท่าน ทางผู้จัดทำจะไม่กำหนดเงื่อนไขในการให้ความยินยอมเพื่อให้เข้าถึงการรับบริการหากข้อมูลส่วนบุคคลนั้นไม่มีความจำเป็นต่อการใช้งานระบบ
     และหากท่านต้องการยุติการใช้งานระบบ สามารถถอดถอนความยินยอมเเละขอลบบัญชีผู้ใช้งานได้ บัญชีจะไม่สามารถเข้าถึงได้และจะลบออกจาก ระบบไปพร้อมกับข้อมูลกิจกรรมที่ท่านเคยดำเนินไว้ในบัญชีนั้นเมื่อ 30 วันให้หลัง`,
        },
        {
          title: `5. การเปิดเผยข้อมูลส่วนบุคคล`,
          content: `    ในการดำเนินการกิจกรรมในระบบเพื่อเพิ่มใบประกาศ มีความจำเป็นที่ต้องเปิดเผยชื่อ-นามสกุลให้กับผู้อื่น และติดต่อประกาศเพื่อนัดหมาย ในการรับส่งสิ่งของ มีความจำเป็นที่ต้องเปิดเผยที่อยู่ให้กับบุคคลที่มาติดต่อ`,
        },
        {
          title: `6. สิทธิของเจ้าของข้อมูลส่วนบุคคล`,
          content: `    ท่านมีสิทธิดังต่อไปนี้ภายใต้หลักเกณฑ์ตามกฏหมาย ว่าด้วยการคุ้มครองข้อมูลส่วนบุคคลทั่วไปของประเทศไทย หรือ พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
     6.1 ท่านสามารถถอนความยินยอมได้โดยการ ลบบัญชีผู้ใช้งาน ออกจากระบบ แต่เมื่อถอนเเล้วทางผู้จัดทำจำเป็นต้องปิดการเข้าถึงการใช้งานระบบของท่าน เเละท่านอาจเสียสิทธิประโยชน์ในการใช้งาน เเละการจัดเก็บข้อมูลการดำเนินกิจกรรมในระบบ
     6.2 ท่านสามารถแก้ไข หรือปรับปรุงข้อมูลส่วนบุคคลของท่านที่อยู่ในความรับผิดชอบของผู้จัดทำโครงงาน ให้ถูกต้องเป็นปัจจุบัน สมบูรณ์ ได้โดยไม่ต้องขอการเข้าถึง
     6.3 ท่านสามารถติดต่อทางผู้จัดทำโครงงาน เมื่อเกิดเหตุขัดข้องเกี่ยวกับระบบการใช้งาน หรือเกิดปัญหาทางด้านข้อมูลทำให้ไม่สามารถ ใช้งานระบบได้อย่างถูกต้อง
     6.4 ท่านสามารถติดต่อขอข้อมูลประวัติการสนทนา หรือกิจกรรมที่ดำเนินการในระบบ จากทางผู้จัดทำโครงงาน เมื่อเกิดเหตุการกระทำ        ที่ผิดกฏหมาย หลอกลวง ทำให้เสียทรัพย์ เพื่อนำไปเป็นหลักฐานฟ้องร้องหรือแจ้งความตามกระบวนการทางกฏหมายได้`,
        },
        {
          title: `7. การปรับปรุงนโยบายข้อมูลส่วนบุคคล`,
          content: `    โครงงานนี้ขอสงวนสิทธิ์ในการแก้ไขปรับปรุงนโยบายข้อมูลส่วนบุคคลฉบับนี้ โดยผู้จัดทำโครงงานจะแจ้งให้ท่านทราบถึงการแก้ไข เปลี่ยนแปลงรายละเอียดอื่น ๆ ที่เกี่ยวข้องกับข้อมูลส่วนบุคคลของท่านเพิ่มเติม ในกรณีที่อยู่นอกเหนือจากนโยบายฉบับนี้ และถ้าเป็นกรณีที่ต้องได้รับความยินยอมจากท่านตามกฎหมาย นโยบายที่มีการแก้ไขเปลี่ยนแปลงจะมีผลใช้บังคับเมื่อได้รับความยินยอมจากท่าน`,
        },
        {
          title: `8. ติดต่อเรา`,
          content: `    ในกรณีที่ท่านมีข้อสงสัย หรือข้อเสนอเเนะ เกี่ยวกับนโยบายฉบับนี้ หรือต้องการขอใช้สิทธิของท่าน ท่านสามารถติดต่อผู้จัดทำโครงงานผ่าน อีเมลในสังกัดหน่วยงานของ มหาวิทยาลัยเกษตรศาสตร์ ได้แก่ kanrawee.pe@ku.th หรือ theeraporn.b@ku.th
     ทางผู้จัดทำโครงงาน ยินดีตอบข้อสงสัย รับฟังข้อเสนอแนะ อันจะเป็นประโยชน์ต่อการปรับปรุงการให้บริการของ ระบบของหายได้คืนแบบ ไร้ศูนย์กายภาพ (Physical Center-less Lost and Found System) ต่อไป`,
        },
      ],
    };
  },
  methods: {
    back() {
      this.$router.back();
    },
  },
};
</script>

<style scoped>
h1 {
  font-family: "Noto Serif Thai";
  font-style: normal;
  font-weight: 700;
  font-size: 48px;
  line-height: 77px;
  text-align: center;
}
h3 {
  font-family: "Noto Serif Thai";
  font-style: normal;
  font-weight: 700;
  font-size: 20px;
  line-height: 32px;
}
p {
  font-family: "Noto Serif Thai";
  font-style: normal;
  font-weight: 400;
  font-size: 20px;
  line-height: 32px;
}
.back-btn {
  font-family: "Noto Serif Thai";
  font-style: normal;
  font-weight: 700;
  font-size: 16px;
  line-height: 26px;
}
</style>
