<template>
  <v-container class="d-flex flex-column">
    <h1 class="text-blueGreen mt-10">กฎหมายการรับสินน้ำใจ</h1>
    <h2 class="text-blueGreen mt-8">
      สิทธิได้รับรางวัลจากเจ้าของหรือผู้ที่มีสิทธิได้รับของนั้น
    </h2>

    <p style="white-space: pre-wrap" class="my-8">
      {{ content }}
    </p>
  </v-container>
</template>

<script>
export default {
  name: "RewardLaw",
  data() {
    return {
      content: `     ตามประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1324 คือ คุณสามารถเรียกเอารางวัลจากผู้ที่เป็นเจ้าของหรือผู้ที่มีสิทธิได้รับของนั้น เป็นจำนวนร้อยละ 10 ของราคาของสิ่งของนั้น เช่น ของตกหายมีค่า 30,000 บาท ผู้เก็บได้จะได้รางวัล 3,000 บาท หรือ 10% ของ 30,000 บาท หากของตกหายมีมูลค่ามากกว่า 30,000 บาท ให้คิดเอาอีกร้อยละ 5 ของจำนวนเกินที่เกินจาก 30,000 บาท เช่น ทรัพย์สินหายที่ค่า 50,000 บาท ผู้เก็บได้จะได้รางวัลจาก 30,000 บาทแรก คือ 3,000 บาท และส่วนที่เกินมาอีก 20,000 บาท จะได้รับมา 5% ของ 20,000 บาท ซึ่งก็คือ 1,000 บาท รวมทั้งสิ้น จากมูลค่าทรัพย์สินหาย 50,000 บาท ผู้เก็บได้จะได้รางวัลทั้งสิ้น 4,000 บาท
     
      หากคุณซึ่งเป็นผู้ที่เก็บของตกหายได้ นำของที่เก็บได้ส่งเจ้าหน้าที่หรือเจ้าพนักงานตำรวจ เจ้าของทรัพย์สินหรือผู้ที่มีสิทธิได้รับของนั้นเสียเงิน จะต้องเงินเพิ่มต่างหาก จากรางวัลที่จะต้องให้อีก 2.5% ของทรัพย์สินตกหายเป็นค่าธรรมเนียม แต่ค่าธรรมเนียมนี้จำกัดไว้ไม่เกิน 1,000 บาท ยกเว้นกรณีผู้ที่เก็บของตกหายได้ ไม่ทำตามหน้าที่ที่กำหนดไว้ตามประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1323 ผู้นั้นไม่มีสิทธิรับรางวัลตามกฎหมาย เช่น เก็บได้แล้วไม่ส่งคืนเจ้าของ ไม่แจ้งเจ้าของ หรือไม่ส่งมอบแก่เจ้าพนักงานตำรวจ ย่อมไม่มีสิทธิได้รับรางวัล

     หลักกฎหมายแพ่งและพาณิชย์ เกี่ยวข้อง

     มาตรา 1323 บุคคลเก็บได้ซึ่งทรัพย์สินหาย ต้องทำอย่างหนึ่งอย่างใด ดังต่อไปนี้

          (1) ส่งมอบทรัพย์สินนั้นแก่ผู้ของหายหรือเจ้าของ หรือบุคคลอื่นผู้มีสิทธิจะรับทรัพย์สินนั้น หรือ

          (2) แจ้งแก่ผู้ของหายหรือเจ้าของ หรือบุคคลอื่นผู้มีสิทธิจะรับทรัพย์สิน นั้นโดยมิชักช้า หรือ

          (3) ส่งมอบทรัพย์สินนั้นแก่เจ้าพนักงานตำรวจ หรือพนักงานเจ้าหน้าที่อื่นภายใน 3 วันและแจ้งสถานการณ์ตามที่ทราบเพื่อเป็นเครื่องมือ ช่วยในการสืบหาตัวบุคคลผู้มีสิทธิจะรับทรัพย์สินนั้น

      แต่ถ้าไม่ทราบตัวผู้ของหาย เจ้าของ หรือบุคคลอื่นผู้มีสิทธิจะรับทรัพย์สิน ก็ดี หรือบุคคลดั่งระบุนั้นไม่รับมอบทรัพย์สินก็ดี ท่านให้ดำเนินการตามวิธีอันบัญญัติไว้ในอนุมาตรา (3)

     ทั้งนี้ ท่านว่าผู้เก็บได้ซึ่งทรัพย์สินหายต้องรักษาทรัพย์สินนั้นไว้ด้วย ความระมัดระวังอันสมควรจนกว่าจะส่งมอบ

     มาตรา 1324 ผู้เก็บได้ซึ่งทรัพย์สินหาย อาจเรียกร้องเอารางวัลจากบุคคลผู้มีสิทธิจะรับทรัพย์สินนั้นเป็นจำนวนร้อยละ 10 แห่งค่าทรัพย์สินภายในราคา 30,000 บาทและถ้าราคาสูงกว่านั้นขึ้นไปให้คิดให้อีกร้อยละ 5 ในจำนวนที่เพิ่มขึ้น แต่ถ้าผู้เก็บได้ซึ่งทรัพย์สินหายได้ส่งมอบทรัพย์สินแก่เจ้าพนักงานตำรวจหรือพนักงานเจ้าหน้าที่อื่น ให้เสียเงินอีกร้อยละ 2.5 แห่งค่าทรัพย์สินเป็นค่าธรรมเนียมแก่ทบวงการนั้นๆ เพิ่มขึ้นเป็นส่วนหนึ่งต่างหากจากรางวัลซึ่งให้แก่ผู้เก็บได้แต่ค่าธรรมเนียมนี้ให้จำกัดไว้ไม่เกิน 1,000 บาท
     ถ้าผู้เก็บได้ซึ่งทรัพย์สินหายมิได้ปฏิบัติตามบทบัญญัติใน มาตรา ก่อนไซร้ ท่านว่าผู้นั้นไม่มีสิทธิจะรับรางวัล

     มาตรา 1325 ถ้าผู้เก็บได้ซึ่งทรัพย์สินหายได้ปฏิบัติตามบทบัญญัติ มาตรา 1323 แล้ว และผู้มีสิทธิจะรับทรัพย์สินนั้นมิได้เรียกเอาภายใน 1 ปีนับแต่วัน ที่เก็บได้ไซร้ ท่านว่ากรรมสิทธิ์ตกแก่ผู้เก็บได้
     
     แต่ถ้าทรัพย์สินซึ่งไม่มีผู้เรียกเอานั้นเป็นโบราณวัตถุไซร้ กรรมสิทธิ์แห่งทรัพย์สินนั้นตกแก่แผ่นดิน แต่ผู้เก็บได้มีสิทธิจะได้รับรางวัลร้อยละ 10 แห่งค่าทรัพย์สินนั้น
`,
    };
  },
};
</script>

<style scoped>
h1 {
  font-family: "Noto Serif Thai";
  font-style: normal;
  font-weight: 700;
  font-size: 48px;
  line-height: 77px;
  text-align: center;
}
h2 {
  font-family: "Noto Serif Thai";
  font-style: normal;
  font-weight: 700;
  font-size: 32px;
  line-height: 51px;
  text-align: center;
}
p {
  font-family: "Noto Serif Thai";
  font-style: normal;
  font-weight: 400;
  font-size: 20px;
  line-height: 32px;
}
</style>
